CSI API ETABS v1

# cSapModelTower Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cTower Tower { get; }

    ReadOnly Property Tower As cTower
    	Get

    Dim instance As cSapModel
    Dim value As cTower

    value = instance.Tower

    property cTower^ Tower {
    	cTower^ get ();
    }

    abstract Tower : cTower with get

#### Property Value

Type: cTower

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com